Autodesk.Revit.DB.Structure.IRebarSpliceServer.UpdateShiftedBarInSplice(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Int32)
Override this function to update the ShiftBarInSplice for the specified rebar at the specified end.
document:
The document.
rebarId:
The bar id.
barEnd:
The bar end where the shift was changed.

Autodesk.Revit.DB.Structure.IRebarSpliceServer.TransformLapPosition(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Int32,Autodesk.Revit.DB.ElementId,System.Int32,Autodesk.Revit.DB.Transform)
Overrides this function to transform the position of the lap.
document:
The document.
sourceRebarId:
The id of the source Rebar element that needs to be updated.
sourceEnd:
The end of the source rebar that is connected to the target rebar
targetRebarId:
The id of the target Rebar element that needs to be updated.
targetEnd:
The end of the target rebar that is connected to the source rebar.
transform:
The transform that needs to be applied.
Returns:
Returns true if the lap position was transformed correctly, false otherwise.

Autodesk.Revit.DB.Structure.IRebarSpliceServer.UnifyRebars(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Override this function to unify two Rebar elements.
document:
The document.
firstRebar:
The first Rebar element that takes part in the unification process.
secondRebar:
The second Rebar element that takes part in the unification process.
Returns:
Returns the element id of the unified rebar.

Autodesk.Revit.DB.Structure.IRebarSpliceServer.SpliceRebar(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarSpliceOptions,System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.RebarSpliceGeometry})
Override this function to split the rebar.
document:
The document.
rebarToSplit:
The rebar that will be split
spliceOptions:
The rebar splice options.
spliceGeometries:
The splice geometries where this rebar will be split.
Returns:
Returns the ids of the rebars that are considerred to be spliced.
This array may contain ids of new created rebars, or the id of the input one.

Autodesk.Revit.DB.Structure.IRebarSpliceServer
Represents an interface that should be overridden to allow Rebar splicing.